{
    "projects": [
        {
            "id": "pelicanMall",
            "title": "PelicanMall eCommerce Website",
            "short_description": "An eCommerce website built for a computer shop.",
            "full_description": "A full-stack PHP-based eCommerce platform developed for Pelicantech, allowing product listing, customer accounts, and basic order management.",
            "image": "./resources/pelicanmall/Screenshot (26).png",
            "gallery": [
                {
                    "alt": "PelicanMall Home Page",
                    "src": "./resources/pelicanmall/Screenshot (26).png"
                },
                {
                    "alt": "PelicanMall Home Page",
                    "src": "./resources/pelicanmall/Screenshot (27).png"
                },
                {
                    "alt": "PelicanMall Home Page",
                    "src": "./resources/pelicanmall/Screenshot (28).png"
                },
                {
                    "alt": "PelicanMall Login Page",
                    "src": "./resources/pelicanmall/Screenshot (68).png"
                },
                {
                    "alt": "PelicanMall Sign up Page",
                    "src": "./resources/pelicanmall/Screenshot (95).png"
                },
                {
                    "alt": "PelicanMall Product Catelog",
                    "src": "./resources/pelicanmall/Screenshot (139).png"
                },
                {
                    "alt": "PelicanMall Single Product View",
                    "src": "./resources/pelicanmall/Screenshot (175).png"
                },
                {
                    "alt": "PelicanMall Shopping Cart",
                    "src": "./resources/pelicanmall/Screenshot (177).png"
                }
            ],
            "client": {
                "type": "Academic Project",
                "name": "Academic Project",
                "industry": "E-commerce",
                "location": "Sri Lanka"
            },
            "timeline": "One Month",
            "role": "Full-Stack Developer",
            "project_overview": [
                "PelicanMall is a full-featured e-commerce web application developed as part of a viva project for Pelican Software Solutions. It provides a streamlined online shopping experience for customers and a robust management interface for administrators."
            ],
            "challenge": {
                "title_change": "Key Features",
                "paragraphs": [],
                "points": [
                    "Product Catalog: Dynamic display of products with categories, search, and filtering.",
                    "User Authentication: Secure user registration, login, and role-based access (customer/admin).",
                    "Shopping Cart: Persistent cart system with item quantity management.",
                    "Order Management: Users can place, track, and view their order history. Admins can manage orders and update statuses.",
                    "Admin Dashboard: Product CRUD operations, order analytics, and user management via a clean dashboard UI.",
                    "Responsive Design: Mobile-friendly layout using Bootstrap and responsive web design practices.",
                    "Secure Backend: Input validation, session handling, and secure database queries."
                ]
            },
            "technologies_used": {
                "tech_stack": [
                    "HTML",
                    "Bootstrap",
                    "JavaScript",
                    "PHP",
                    "MySQL",
                    "AJAX",
                    "Stripe"
                ],
                "description": "The project was developed using a combination of HTML, Bootstrap, JavaScript, PHP, MySQL, and AJAX. The front-end was designed with Bootstrap for responsiveness and ease of use, while the back-end was built with PHP and MySQL for data management. AJAX was used for dynamic content loading without page refreshes."
            },
            "card_section_1": {
                "title": "Highlights",
                "paragraph": "I developed a lightweight but scalable eCommerce platform that works smoothly on free hosting. The admin panel allows easy control over product listings and orders.",
                "details": [
                    {
                        "icon": "fa-box",
                        "title": "Custom Admin Panel",
                        "description": "Built from scratch to manage inventory and view orders."
                    },
                    {
                        "icon": "fa-mobile-alt",
                        "title": "Mobile Friendly",
                        "description": "Responsive layout ensured easy shopping on all devices."
                    }
                ]
            },
            "results_impact": {
                "paragraph": "PelicanMall's launch allowed the client to expand their customer base beyond physical store visitors, resulting in a noticeable boost in online engagement and sales.",
                "details": [
                    {
                        "digit": "200+",
                        "impact": "Unique Visitors per Month"
                    },
                    {
                        "digit": "10+",
                        "impact": "Daily Orders"
                    }
                ]
            },
            "key_learnings": {
                "paragraphs": [
                    "Collaborating with clients who lack technical knowledge taught me the importance of intuitive UI design and effective communication.",
                    "Deploying on free hosting plans introduced performance challenges, which improved my skills in code and database optimization."
                ],
                "points": [
                    "Prioritize mobile responsiveness from the start of development.",
                    "Write efficient SQL queries to minimize server load, especially on limited hosting plans.",
                    "Build admin interfaces that match real user workflows, not just developer assumptions."
                ]
            }
        }
    ]
}